app/Controllers/Admin/Usuarios.php

SELECT *
FROM `usuarios`
---
  public function index() {

    $data = [
      'titulo' => 'Listando os usuarios do sistema',
      'usuarios' => $this->usuarioModel->withDeleted(true)->paginate(5),

INSERT INTO `usuarios` (`nome`, `cpf`, `telefone`, `email`, `is_admin`, `ativo`, `criado_em`, `atualizado_em`, `password_hash`) VALUES ('dhi', '999.999.999-99', '(99) 99999-9999', 'dhi@email.com', '1', '1', '2024-06-18 00:16:17', '2024-06-18 00:16:17', '$2y$10$RyeYa0HGvoDYHk0FvgmY6.CvQrJ47kuVNcVBPxclnZAh8tkNL3.Lq')
---
  public function cadastrar() {
    if($this->request->getPost()) {  //if($this->request->getMethod() === 'post') {

      $usuario = new Usuario($this->request->getPost());

      if($this->usuarioModel->protect(false)->save($usuario)) {

UPDATE `usuarios` SET `is_admin` = '0', `atualizado_em` = '2024-06-19 21:19:26', `password_hash` = '$2y$10$n5XSiEbQmwiwHBmzP5Ksxe.JTn2Yb6GQqZcCy0H/mK/bWnhsjnDLW'
WHERE `usuarios`.`id` IN ('9')
---
  public function atualizar($id = null) {
    if($this->request->getPost()) {  //if($this->request->getMethod() === 'post') {
      $usuario = $this->buscaUsuarioOu404($id);

      if($usuario->deletado_em != null){
        return redirect()->back()->with('info', "O usuario $usuario->nome encontra-se excluido! Portanto, não e possivel edita-lo!");
      }

      $post = $this->request->getPost();

      if(empty($post['password'])) {
        $this->usuarioModel->desabilitarValidacaoSenha();
        unset($post['password']);
        unset($post['password_confirmation']);
      }

      $usuario->fill($post);
      // dd($usuario);

      if (!$usuario->hasChanged()) {
        return redirect()->back()->with('info', 'Não há dados para atualizar!');
      }

      if($this->usuarioModel->protect(false)->save($usuario)) {

SELECT *
FROM `usuarios`
WHERE `id` = 9
GROUP BY `usuarios`.`id`
ORDER BY `usuarios`.`id` ASC
 LIMIT 1
---
  private function buscaUsuarioOu404(int $id = null) {
    if (!$id || !$usuario = $this->usuarioModel->withDeleted(true)->where('id', $id)->first()) {