app/Models/UsuarioModel.php

UPDATE `usuarios` SET `deletado_em` = NULL, `atualizado_em` = '2024-06-18 16:29:01'
WHERE `id` = 9
---
    public function desfazerExclusao(int $id) {

        return $this->protect(false)
        ->where('id', $id)
        ->set('deletado_em', null)
        ->update();